# Core CLI tools
brew "git"        # Version control
brew "curl"       # HTTP requests
brew "jq"         # JSON processor

# Search & navigation
brew "ripgrep"    # Fast code search (rg)
brew "fd"         # Fast file finder
brew "fzf"        # Fuzzy finder
brew "bat"        # Better cat with syntax highlighting
brew "eza"        # Modern ls replacement
brew "tree"       # Directory structure display
brew "zoxide"     # Smarter cd

# Development
brew "fnm"        # Fast Node Manager
brew "gh"         # GitHub CLI
brew "starship"   # Cross-shell prompt

# Formatting & linting
brew "shfmt"      # Shell formatter
brew "dprint"     # Markdown/JSON/YAML formatter
brew "lefthook"   # Git hooks manager

# Fonts
cask "font-jetbrains-mono-nerd-font"  # Programming font with icons

# GUI Applications
cask "visual-studio-code"  # Code editor
cask "docker-desktop"      # Containers
cask "kitty"               # Terminal emulator
cask "rectangle"           # Window management
cask "1password"           # Password manager
cask "slack"               # Team communication
cask "raycast"             # Launcher/productivity
